FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
        <register>
          <name>PACRB</name>
          <description>Peripheral Access Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44000400</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP5</name>
              <description>Trusted Protect</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP5_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP5_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP5</name>
              <description>Write Protect</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP5_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP5_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP5</name>
              <description>Supervisor Protect</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP5_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP5_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP1</name>
              <description>Trusted Protect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP1_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP1</name>
              <description>Write Protect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP1_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP1</name>
              <description>Supervisor Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP1_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PACRD</name>
          <description>Peripheral Access Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TP1</name>
              <description>Trusted Protect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP1_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP1</name>
              <description>Write Protect</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP1_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP1_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP1</name>
              <description>Supervisor Protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP1_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP1_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TP0</name>
              <description>Trusted Protect</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0_0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP0_1</name>
                  <description>Accesses from an untrusted master are not allowed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WP0</name>
              <description>Write Protect</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WP0_0</name>
                  <description>This peripheral allows write accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP0_1</name>
                  <description>This peripheral is write protected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SP0</name>
              <description>Supervisor Protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SP0_0</name>
                  <description>This peripheral does not require supervisor privilege level for accesses.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SP0_1</name>
                  <description>This peripheral requires supervisor privilege level for accesses.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
