FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
        <register>
          <name>SC1P</name>
          <description>ADC Status and Control Register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>External channel 0 is selected as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>External channel 1 is selected as input.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>External channel 2 is selected as input.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>External channel 3 is selected as input.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>External channel 4 is selected as input.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>External channel 5 is selected as input.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>External channel 6 is selected as input.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>External channel 7 is selected as input.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>External channel 8 is selected as input.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>External channel 9 is selected as input.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>External channel 10 is selected as input.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>External channel 11 is selected as input.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>External channel 12 is selected as input.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>External channel 13 is selected as input.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_14</name>
                  <description>External channel 14 is selected as input.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_15</name>
                  <description>External channel 15 is selected as input.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_21</name>
                  <description>Internal channel 0 is selected as input.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_22</name>
                  <description>Internal channel 1 is selected as input.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_23</name>
                  <description>Internal channel 2 is selected as input.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_27</name>
                  <description>Band Gap</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_28</name>
                  <description>Internal channel 3 is selected as input.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_29</name>
                  <description>VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_30</name>
                  <description>VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_32</name>
                  <description>External channel 16 is selected as input.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_33</name>
                  <description>External channel 17 is selected as input.</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_34</name>
                  <description>External channel 18 is selected as input.</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_35</name>
                  <description>External channel 19 is selected as input.</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_36</name>
                  <description>External channel 20 is selected as input.</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_37</name>
                  <description>External channel 21 is selected as input.</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_38</name>
                  <description>External channel 22 is selected as input.</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_39</name>
                  <description>External channel 23 is selected as input.</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_40</name>
                  <description>External channel 24 is selected as input.</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_41</name>
                  <description>External channel 25 is selected as input.</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_42</name>
                  <description>External channel 26 is selected as input.</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_43</name>
                  <description>External channel 27 is selected as input.</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_44</name>
                  <description>External channel 28 is selected as input.</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_45</name>
                  <description>External channel 29 is selected as input.</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_46</name>
                  <description>External channel 30 is selected as input.</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_47</name>
                  <description>External channel 31 is selected as input.</description>
                  <value>0x2F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIEN_0</name>
                  <description>Conversion complete interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIEN_1</name>
                  <description>Conversion complete interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COCO</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COCO_0</name>
                  <description>Conversion is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COCO_1</name>
                  <description>Conversion is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG1</name>
          <description>ADC Configuration Register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADICLK</name>
              <description>Input Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADICLK_0</name>
                  <description>Alternate clock 1 (ALTCLK1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADICLK_1</name>
                  <description>Alternate clock 2 (ALTCLK2)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADICLK_2</name>
                  <description>Alternate clock 3 (ALTCLK3)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADICLK_3</name>
                  <description>Alternate clock 4 (ALTCLK4)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>Conversion mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>8-bit conversion.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>12-bit conversion.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_2</name>
                  <description>10-bit conversion.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIV</name>
              <description>Clock Divide Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIV_0</name>
                  <description>The divide ratio is 1 and the clock rate is input clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_1</name>
                  <description>The divide ratio is 2 and the clock rate is (input clock)/2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_2</name>
                  <description>The divide ratio is 4 and the clock rate is (input clock)/4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIV_3</name>
                  <description>The divide ratio is 8 and the clock rate is (input clock)/8.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRLTRG</name>
              <description>Clear Latch Trigger in Trigger Handler Block</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG2</name>
          <description>ADC Configuration Register 2</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPLTS</name>
              <description>Sample Time Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RA</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RB</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RC</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RE</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RG</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RH</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RI</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RJ</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RK</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RL</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RM</name>
          <description>ADC Data Result Registers</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>Data result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
