FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
        <register>
          <name>FTMOPT0</name>
          <description>FTM Option Register 0</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FTM0FLTxSEL</name>
              <description>FTM0 Fault X Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM0FLTxSEL_0</name>
                  <description>FTM0_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0FLTxSEL_1</name>
                  <description>TRGMUX_FTM0 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM1FLTxSEL</name>
              <description>FTM1 Fault X Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM1FLTxSEL_0</name>
                  <description>FTM1_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1FLTxSEL_1</name>
                  <description>TRGMUX_FTM1 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM2FLTxSEL</name>
              <description>FTM2 Fault X Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM2FLTxSEL_0</name>
                  <description>FTM2_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2FLTxSEL_1</name>
                  <description>TRGMUX_FTM2 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM3FLTxSEL</name>
              <description>FTM3 Fault X Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM3FLTxSEL_0</name>
                  <description>FTM3_FLTx pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM3FLTxSEL_1</name>
                  <description>TRGMUX_FTM3 out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM4CLKSEL</name>
              <description>FTM4 External Clock Pin Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM4CLKSEL_0</name>
                  <description>FTM4 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM4CLKSEL_1</name>
                  <description>FTM4 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM4CLKSEL_2</name>
                  <description>FTM4 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM4CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM5CLKSEL</name>
              <description>FTM5 External Clock Pin Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM5CLKSEL_0</name>
                  <description>FTM5 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM5CLKSEL_1</name>
                  <description>FTM5 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM5CLKSEL_2</name>
                  <description>FTM5 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM5CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM6CLKSEL</name>
              <description>FTM6 External Clock Pin Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM6CLKSEL_0</name>
                  <description>FTM6 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM6CLKSEL_1</name>
                  <description>FTM6 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM6CLKSEL_2</name>
                  <description>FTM6 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM6CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM7CLKSEL</name>
              <description>FTM7 External Clock Pin Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM7CLKSEL_0</name>
                  <description>FTM7 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM7CLKSEL_1</name>
                  <description>FTM7 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM7CLKSEL_2</name>
                  <description>FTM7 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM7CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM0CLKSEL</name>
              <description>FTM0 External Clock Pin Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM0CLKSEL_0</name>
                  <description>FTM0 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_1</name>
                  <description>FTM0 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_2</name>
                  <description>FTM0 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM0CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM1CLKSEL</name>
              <description>FTM1 External Clock Pin Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM1CLKSEL_0</name>
                  <description>FTM1 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_1</name>
                  <description>FTM1 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_2</name>
                  <description>FTM1 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM1CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM2CLKSEL</name>
              <description>FTM2 External Clock Pin Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM2CLKSEL_0</name>
                  <description>FTM2 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2CLKSEL_1</name>
                  <description>FTM2 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2CLKSEL_2</name>
                  <description>FTM2 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM2CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTM3CLKSEL</name>
              <description>FTM3 External Clock Pin Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTM3CLKSEL_0</name>
                  <description>FTM3 external clock driven by TCLK0 pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM3CLKSEL_1</name>
                  <description>FTM3 external clock driven by TCLK1 pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM3CLKSEL_2</name>
                  <description>FTM3 external clock driven by TCLK2 pin.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTM3CLKSEL_3</name>
                  <description>No clock input</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOCLKS</name>
          <description>LPO Clock Select Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPO1KCLKEN</name>
              <description>LPO1K_CLK enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPO1KCLKEN_0</name>
                  <description>Disable LPO1K_CLK output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPO1KCLKEN_1</name>
                  <description>Enable LPO1K_CLK output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPO32KCLKEN</name>
              <description>LPO32K_CLK enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPO32KCLKEN_0</name>
                  <description>Disable LPO32K_CLK output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPO32KCLKEN_1</name>
                  <description>Enable LPO32K_CLK output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOCLKSEL</name>
              <description>LPO clock source select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOCLKSEL_0</name>
                  <description>LPO128K_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_1</name>
                  <description>No clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_2</name>
                  <description>LPO32K_CLK which is derived from the LPO128K_CLK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOCLKSEL_3</name>
                  <description>LPO1K_CLK which is derived from the LPO128K_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCCLKSEL</name>
              <description>32 kHz clock source select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCLKSEL_0</name>
                  <description>SOSCDIV1_CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_1</name>
                  <description>LPO32K_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_2</name>
                  <description>32 kHz RTC_CLKIN clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCLKSEL_3</name>
                  <description>FIRCDIV1_CLK</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
