FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
        <register>
          <name>GICHR</name>
          <description>Global Interrupt Control High Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GIWE0</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE1</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE2</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE3</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE4</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE5</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE6</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE7</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE8</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE9</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE10</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE11</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE12</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE13</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE14</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWE15</name>
              <description>Global Interrupt Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GIWE_0</name>
                  <description>Corresponding Pin Control Register is not updated with the value in GPWD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GIWE_1</name>
                  <description>Corresponding Pin Control Register is updated with the value in GPWD.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GIWD</name>
              <description>Global Interrupt Write Data</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
