FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
                <enumeratedValue>
                  <name>DLYTAPSELB_3</name>
                  <description>Select 4 delay chain tap</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_4</name>
                  <description>Select 5 delay chain tap</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_5</name>
                  <description>Select 6 delay chain tap</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_6</name>
                  <description>Select 7 delay chain tap</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_7</name>
                  <description>Select 8 delay chain tap</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_8</name>
                  <description>Select 9 delay chain tap</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_9</name>
                  <description>Select 10 delay chain tap</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_10</name>
                  <description>Select 11 delay chain tap</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_11</name>
                  <description>Select 12 delay chain tap</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_12</name>
                  <description>Select 13 delay chain tap</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_13</name>
                  <description>Select 14 delay chain tap</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_14</name>
                  <description>Select 15 delay chain tap</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_15</name>
                  <description>Select 16 delay chain tap</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_16</name>
                  <description>Select 17 delay chain tap</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_17</name>
                  <description>Select 18 delay chain tap</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_18</name>
                  <description>Select 19 delay chain tap</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_19</name>
                  <description>Select 20 delay chain tap</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_20</name>
                  <description>Select 21 delay chain tap</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_21</name>
                  <description>Select 22 delay chain tap</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_22</name>
                  <description>Select 23 delay chain tap</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_23</name>
                  <description>Select 24 delay chain tap</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_24</name>
                  <description>Select 25 delay chain tap</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_25</name>
                  <description>Select 26 delay chain tap</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_26</name>
                  <description>Select 27 delay chain tap</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_27</name>
                  <description>Select 28 delay chain tap</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_28</name>
                  <description>Select 29 delay chain tap</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_29</name>
                  <description>Select 30 delay chain tap</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_30</name>
                  <description>Select 31 delay chain tap</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_31</name>
                  <description>Select 32 delay chain tap</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_32</name>
                  <description>Select 33 delay chain tap</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_33</name>
                  <description>Select 34 delay chain tap</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_34</name>
                  <description>Select 35 delay chain tap</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_35</name>
                  <description>Select 36 delay chain tap</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_36</name>
                  <description>Select 37 delay chain tap</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_37</name>
                  <description>Select 38 delay chain tap</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_38</name>
                  <description>Select 39 delay chain tap</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_39</name>
                  <description>Select 40 delay chain tap</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_40</name>
                  <description>Select 41 delay chain tap</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_41</name>
                  <description>Select 42 delay chain tap</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_42</name>
                  <description>Select 43 delay chain tap</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_43</name>
                  <description>Select 44 delay chain tap</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_44</name>
                  <description>Select 45 delay chain tap</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_45</name>
                  <description>Select 46 delay chain tap</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_46</name>
                  <description>Select 47 delay chain tap</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_47</name>
                  <description>Select 48 delay chain tap</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_48</name>
                  <description>Select 49 delay chain tap</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_49</name>
                  <description>Select 50 delay chain tap</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_50</name>
                  <description>Select 51 delay chain tap</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_51</name>
                  <description>Select 52 delay chain tap</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_52</name>
                  <description>Select 53 delay chain tap</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_53</name>
                  <description>Select 54 delay chain tap</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_54</name>
                  <description>Select 55 delay chain tap</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_55</name>
                  <description>Select 56 delay chain tap</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_56</name>
                  <description>Select 57 delay chain tap</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_57</name>
                  <description>Select 58 delay chain tap</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_58</name>
                  <description>Select 59 delay chain tap</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_59</name>
                  <description>Select 60 delay chain tap</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_60</name>
                  <description>Select 61 delay chain tap</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_61</name>
                  <description>Select 62 delay chain tap</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_62</name>
                  <description>Select 63 delay chain tap</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLYTAPSELB_63</name>
                  <description>Select 64 delay chain tap</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_BUF0IND</name>
          <description>Buffer0 Top Index Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX0</name>
              <description>Top index of buffer 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_BUF1IND</name>
          <description>Buffer1 Top Index Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX1</name>
              <description>Top index of buffer 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_BUF2IND</name>
          <description>Buffer2 Top Index Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPINDX2</name>
              <description>Top index of buffer 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_SFAR</name>
          <description>Serial Flash Address Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SFADR</name>
              <description>Serial Flash Address. The register content is used as byte address for all following IP Commands.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_SFACR</name>
          <description>Serial Flash Address Configuration Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAS</name>
              <description>Column Address Space</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WA</name>
              <description>Word Addressable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WA_0</name>
                  <description>Byte addressable serial flash mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WA_1</name>
                  <description>Word (2 byte) addressable serial flash mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_SMPR</name>
          <description>Sampling Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSPHS</name>
              <description>Full Speed Phase selection for SDR instructions.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSPHS_0</name>
                  <description>Select sampling at non-inverted clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSPHS_1</name>
                  <description>Select sampling at inverted clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSDLY</name>
              <description>Full Speed Delay selection for SDR instructions. Select the delay with respect to the reference edge for the sample point valid for full speed commands.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSDLY_0</name>
                  <description>One clock cycle delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSDLY_1</name>
                  <description>Two clock cycles delay.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_RBSR</name>
          <description>RX Buffer Status Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDBFL</name>
              <description>RX Buffer Fill Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDCTR</name>
              <description>Read Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_RBCT</name>
          <description>RX Buffer Control Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMRK</name>
              <description>RX Buffer Watermark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXBRD</name>
              <description>RX Buffer Readout. This field specifies the access scheme for the RX Buffer readout.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXBRD_0</name>
                  <description>RX Buffer content is read using the AHB Bus registers QSPI_ARDB0 to QSPI_ARDB31.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXBRD_1</name>
                  <description>RX Buffer content is read using the IP Bus registers QSPI_RBDR0 to QSPI_RBDR31.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_TBSR</name>
          <description>TX Buffer Status Register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRBFL</name>
              <description>TX Buffer Fill Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRCTR</name>
              <description>Transmit Counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_TBDR</name>
          <description>TX Buffer Data Register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>TX Data On write access the data is written into the next available entry of the TX Buffer and the QPSI_TBSR[TRBFL] field is updated accordingly</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
