FranciscoLlobet/miso2/board/frdmmcxe247/MCXE247.xml
        <register>
          <name>QuadSPI_TBCT</name>
          <description>Tx Buffer Control Register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WMRK</name>
              <description>Determines the watermark for the TX Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_SR</name>
          <description>Status Register</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2003800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>Module Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_ACC</name>
              <description>IP Access. Asserted when transaction currently executed was initiated by IP bus.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB_ACC</name>
              <description>AHB Access. Asserted when the transaction currently executed was initiated by AHB bus.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBTRN</name>
              <description>AHB Access Transaction pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB0NE</name>
              <description>AHB 0 Buffer Not Empty. Asserted when AHB 0 buffer contains data.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB1NE</name>
              <description>AHB 1 Buffer Not Empty. Asserted when AHB 1 buffer contains data.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB2NE</name>
              <description>AHB 2 Buffer Not Empty. Asserted when AHB 2 buffer contains data.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB3NE</name>
              <description>AHB 3 Buffer Not Empty. Asserted when AHB 3 buffer contains data.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB0FUL</name>
              <description>AHB 0 Buffer Full. Asserted when AHB 0 buffer is full.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB1FUL</name>
              <description>AHB 1 Buffer Full. Asserted when AHB 1 buffer is full.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB2FUL</name>
              <description>AHB 2 Buffer Full. Asserted when AHB 2 buffer is full.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHB3FUL</name>
              <description>AHB 3 Buffer Full. Asserted when AHB 3 buffer is full.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXWE</name>
              <description>RX Buffer Watermark Exceeded</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFULL</name>
              <description>RX Buffer Full</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXDMA</name>
              <description>RX Buffer DMA. Asserted when RX Buffer read out via DMA is active i.e DMA is requested or running.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXEDA</name>
              <description>Tx Buffer Enough Data Available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXWA</name>
              <description>TX Buffer watermark Available</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDMA</name>
              <description>TXDMA</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFULL</name>
              <description>TX Buffer Full. Asserted when no more data can be stored.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_FR</name>
          <description>Flag Register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>TFF</name>
              <description>IP Command Transaction Finished Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IPIEF</name>
              <description>IP Command Trigger could not be executed Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>IPAEF</name>
              <description>IP Command Trigger during AHB Access Error Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ABOF</name>
              <description>AHB Buffer Overflow Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AIBSEF</name>
              <description>AHB Illegal Burst Size Error Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AITEF</name>
              <description>AHB Illegal transaction error flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ABSEF</name>
              <description>AHB Sequence Error Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RBDF</name>
              <description>RX Buffer Drain Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RBOF</name>
              <description>RX Buffer Overflow Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ILLINE</name>
              <description>Illegal Instruction Error Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TBUF</name>
              <description>TX Buffer Underrun Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TBFF</name>
              <description>TX Buffer Fill Flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_RSER</name>
          <description>Interrupt and DMA Request Select and Enable Register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TFIE</name>
              <description>Transaction Finished Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TFIE_0</name>
                  <description>No TFF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TFIE_1</name>
                  <description>TFF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPIEIE</name>
              <description>IP Command Trigger during IP Access Error Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPIEIE_0</name>
                  <description>No IPIEF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPIEIE_1</name>
                  <description>IPIEF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPAEIE</name>
              <description>IP Command Trigger during AHB Access Error Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPAEIE_0</name>
                  <description>No IPAEF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPAEIE_1</name>
                  <description>IPAEF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABOIE</name>
              <description>AHB Buffer Overflow Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABOIE_0</name>
                  <description>No ABOF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABOIE_1</name>
                  <description>ABOF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIBSIE</name>
              <description>AHB Illegal Burst Size Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIBSIE_0</name>
                  <description>No AIBSEF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIBSIE_1</name>
                  <description>AIBSEF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AITIE</name>
              <description>AHB Illegal transaction interrupt enable.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AITIE_0</name>
                  <description>No AITEF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AITIE_1</name>
                  <description>AITEF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABSEIE</name>
              <description>AHB Sequence Error Interrupt Enable: Triggered by ABSEF flags of QSPI_FR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABSEIE_0</name>
                  <description>No ABSEF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABSEIE_1</name>
                  <description>ABSEF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBDIE</name>
              <description>RX Buffer Drain Interrupt Enable: Enables generation of IRQ requests for RX Buffer Drain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBDIE_0</name>
                  <description>No RBDF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBDIE_1</name>
                  <description>RBDF Interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBOIE</name>
              <description>RX Buffer Overflow Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBOIE_0</name>
                  <description>No RBOF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBOIE_1</name>
                  <description>RBOF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBDDE</name>
              <description>RX Buffer Drain DMA Enable: Enables generation of DMA requests for RX Buffer Drain</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBDDE_0</name>
                  <description>No DMA request will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBDDE_1</name>
                  <description>DMA request will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ILLINIE</name>
              <description>Illegal Instruction Error Interrupt Enable. Triggered by ILLINE flag in QSPI_FR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ILLINIE_0</name>
                  <description>No ILLINE interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ILLINIE_1</name>
                  <description>ILLINE interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBFDE</name>
              <description>TX Buffer Fill DMA Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBFDE_0</name>
                  <description>No DMA request will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBFDE_1</name>
                  <description>DMA request will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBUIE</name>
              <description>TX Buffer Underrun Interrupt Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBUIE_0</name>
                  <description>No TBUF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBUIE_1</name>
                  <description>TBUF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBFIE</name>
              <description>TX Buffer Fill Interrupt Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBFIE_0</name>
                  <description>No TBFF interrupt will be generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBFIE_1</name>
                  <description>TBFF interrupt will be generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QuadSPI_SPNDST</name>
          <description>Sequence Suspend Status Register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUSPND</name>
              <description>When set, it signifies that a sequence is in suspended state</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPDBUF</name>
              <description>Suspended Buffer: Provides the suspended buffer number. Valid only when SUSPND is set to 1'b1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATLFT</name>
              <description>Data left: Provides information about the amount of data left to be read in the suspended sequence</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
